benchmark/results/run_20260123_224900/homepage.txt
Running 30s test @ http://127.0.0.1:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.70ms   21.64ms  59.90ms   35.05%
    Req/Sec     1.03k    59.72     1.17k    64.50%
  Latency Distribution
     50%   25.97ms
     75%   46.27ms
     90%   50.20ms
     99%   54.23ms
  123110 requests in 30.02s, 30.38MB read
Requests/sec:   4101.33
Transfer/sec:      1.01MB