benchmark/results/run_20260123_224900/medium_file.txt
Running 30s test @ http://127.0.0.1:8080/static/medium.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.68ms   28.27ms 115.47ms   30.67%
    Req/Sec   802.48    113.76     1.01k    69.50%
  Latency Distribution
     50%   33.83ms
     75%   60.52ms
     90%   64.28ms
     99%   69.81ms
  95895 requests in 30.02s, 0.91GB read
Requests/sec:   3194.42
Transfer/sec:     31.20MB